In [1]:
import pandas as pd

In [2]:
fpath = './data/exam.xlsx'
raw = pd.read_excel(fpath)

In [3]:
raw.head()

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [4]:
raw

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [6]:
raw.info

<bound method DataFrame.info of    번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95>

In [7]:
raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   번호      3 non-null      object
 1   국어      3 non-null      int64
 2   영어      3 non-null      int64
 3   수학      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [8]:
raw.describe()

              국어          영어    수학
count   3.000000    3.000000   3.0
mean   76.000000   91.666667  75.0
std    12.165525   10.408330  20.0
min    68.000000   80.000000  55.0
25%    69.000000   87.500000  65.0
50%    70.000000   95.000000  75.0
75%    80.000000   97.500000  85.0
max    90.000000  100.000000  95.0

In [9]:
raw

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [12]:
# 컬럼을 인덱스로 지정하는 방법이다. 
raw.set_index('번호')
# 판다스에서는 원본데이터와 작업 결과를 별개로 나누고자 하기때문에
# 다음 셀에서 raw반환 시 인덱스 지정이 사라진채로 나타난다.

    국어   영어  수학
번호
1번  70   80  75
2번  68   95  55
3번  90  100  95

In [13]:
raw

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [14]:
# 따라서 원본데이터 형태까지 바꾸고 싶다면 쿼리자체를 원본데이터를 다시 정의해줘야 한다
raw = raw.set_index('번호')
raw

    국어   영어  수학
번호
1번  70   80  75
2번  68   95  55
3번  90  100  95

In [15]:
raw

    국어   영어  수학
번호
1번  70   80  75
2번  68   95  55
3번  90  100  95

In [16]:
# 데이터를 불러온 다음에, 인덱스를 지정하는 추가적인 작업을 했다면,
# 처음에 엑셀 파일을 불러올 때 미리 인덱스를 지정하는 방법

fpath = './data/exam.xlsx'
raw = pd.read_excel(fpath, index_col = '번호')  # 엑셀 파일 불러오는 경로를 명시할때, 바로 인덱스로 임명할 컬럼을 지정
raw

    국어   영어  수학
번호
1번  70   80  75
2번  68   95  55
3번  90  100  95

In [20]:
# iloc[인덱스번호, 컬럼번호] - 숫자로 입력 : 인덱스 부분은 순서에 포함 X, 로우, 컬럼 번호로 데이터 선택
raw.iloc[1,0]

68

In [21]:
# 숫자 하나만 입력하면 로우를 의미! 0번부터 시작하므로 인덱스 기준 2번 번호의 데이터가 선택됨
raw.iloc[1]

국어    68
영어    95
수학    55
Name: 2번, dtype: int64

In [22]:
# loc[인덱스명, 컬럼명] - '이름'으로 입력 
raw.loc['2번', '영어']

95

In [23]:
# 3번 영어, 수학점수 따로 출력하기
print(raw.iloc[2,1])
print(raw.loc['3번', '영어'])

100
100

In [24]:
# 1번 국어점수 출력하기
print(raw.iloc[0,0])
print(raw.loc['1번', '국어'])

70
70

In [26]:
# 복수의 셀을 선택하는 경우, df.loc[] 내부에 리스트 형태로 추가 입력하면 됨!
raw.loc[['1번','2번'],'수학']

번호
1번    75
2번    55
Name: 수학, dtype: int64

In [29]:
raw.iloc[2,1]

100

In [30]:
raw.loc[ : , '수학']

번호
1번    75
2번    55
3번    95
Name: 수학, dtype: int64